store = dict()
store["Молоко"] = "68 руб"
store["Сметана"] = "49 руб"
store["Майонез"] = "44 руб"
store["Помидоры"] = "62 руб за кг"
store["Огурцы"] = "76 руб за кг"
store["Яблоки"] = "87 руб за кг"
store["Апельсины"] = "56 руб за кг"
store["Груши"] = "76 руб за кг"
store["Мороженное"] = "35 руб"
store["Конфеты"] = "120 руб за кг"


while True:
    text = input("Введите наименование товара, 'стоп' для выхода,'вывести' для просмотра списка товаров или 'добавить:'")
    if text == "стоп":
        break
    elif text == "добавить":
        product = input ("Введите наименование товара:")
        price = input ("Введите цену товара:")
        store.setdefault(product, price)
        print("Товар успешно добавлен!")
    elif text == "вывести":
        print(store)
    else:
        print("Цена товара",store[text])
